//1.cannot change colour and cannot choose transparency of the text once started typing.At the new position once again can
//2.redo,undo disabled in freehand mode
//3.transparency cannot be enabled in freehand mode

//#include "stdafx.h"
#include<glut.h>
#include<stdlib.h>
#include<math.h>
#include<iostream.h>
#include<stdio.h>
int win_x=1017,win_y=705,win,win1;

GLubyte *grape_sel_pencil_icon="ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜË @@ @@ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜË @@ @@ @@Ë¬hÚÃ‚ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜË @@Å«%áª.Ä¦1\\(,‹C®ØÆÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËØÅMÿŞi×É>©±8~¯5@š52‡K©Í¹ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜË÷×CüâvÄÙu¦ÂR ¸:¯5B›47K¥Ñ³ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËßÚoºÅGÇÜ‡¾Õx¬¾M¦³=~¯4E›+.Š6²Ú¿ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜË³ğ3‡­2¨¿KÂÛ†·Öw¬ÁLœº<ƒ°3L02ŠJÇ¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3‹­. ½IÉÜ…ÀÔv§ÄP»6³;EA5ˆA«Ù¿ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3†¬.¦ÂHÉÖ¢¿Òt²ÀC¡·:·/MŸ-.†IÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3­1§ÃGÉÛ†¾Ò©ÁUœ½,‚³2ÿÿÿ\\qh«²²ÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3‰¯.¨ÃTÅÜ‘½Óx«ÀGÿÿÿ ¬V_]FGG¾»¼ÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3‰­*¨Ã?Ëßwÿÿÿ¾Ã®¥ ®‘b__FCD¸·¸ÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË³ğ3¯5ÿÿÿÑÙËÀ¿Æª¨ª©©©………999XXXÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÿÿÿ€€€‘”™ÄÃÍÅÄÆŸŸŸZZZXXXÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËXXX€€€˜— ¶¶¶rrrXXXÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËXXXXXXlllÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜË€€€ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬ÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËÚÜËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬";
GLubyte *grape_sel_colorpick_icon="ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÿ€¿ÿdËÚÙËÚÙËş§óş´ûù·şÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËü¡¼ÿoĞÿ}ßùœíß†ÓŞ™Úê©éî´øÓŸôÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË÷»½ÿ…Ğı|ãş³üÕqÃ¾R«Î”Ìî°íÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËïÑÀü¡Óı~ã÷šøÿÿÿëëëÌzÃÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËããĞ÷»Ûÿ”éñ€ğÿÿÿëëë¿F¨ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËëëëÿÿÿëëëÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÿÿÿëëëßâàÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÿÿÿëëëÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÿÿÿëëëØÓàÑÕÒÚÚÓÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËéëìÿÿÿ˜—™hfgØÖËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËááÔ˜—™   KKO56:   ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË         .!'   ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË            ˜—™ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËèæÖÚÙË¸·¬         ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËèåÖÚÙËÄÃ»   !.!—–ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË××Í‰ŠJGJ™•ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËèæ×ÖÕÊÅÃºÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬";
GLubyte *grape_sel_eraser_icon="ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÁÁÁÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË´´´‘‘‘¡¡¡âââÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË©©ª““•££¥ÁÁÄÂÂÄÍÍÎÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËªªª‘‘’¤¤¦ÅÅÇÔÔÖ××ÙÈÈÈÎÎÎÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË¨¨¨¢¢¤ÇÇÉÕÕ×ÍÍÍØØÚİİİÍÍÍÑÑÑÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÄÄÄ‹‹‹¤¤¤ÆÆÈÔÔÖÍÍÍØØÛÍÍÍŞŞŞåååÕÕÕÓÓÓÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËççç¢¢¢ÆÆÆÕÕÖÍÍÍØØÙÍÍÍßßàÍÍÍåååëëëÜÜÜØØØÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÚÚÅÅÅ×××ÙÙÙÍÍÍßßßâââåååèèèëëëñññäääÛÛÛÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÙÙÙÍÍÍİİİßßßÍÍÍæææéééìììÿÿÿğğğ÷÷÷êêêÚÚÚÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËßßßÔÔÔãããåååèèèëëëîîîñññôôôÿÿÿûûûôôôİİİÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËâââÛÛÛêêêìììÿÿÿñññÿÿÿ÷÷÷ùùùüüüÿÿÿÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËèèèßßßïïïòòòõõõ÷÷÷úúúÿÿÿşşşÿÿÿÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËèèèèèèõõõÿÿÿùùùÿÿÿşşşÿÿÿúúúÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËííííííûûûüüüÿÿÿÿÿÿúúúÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËğğğñññşşşÿÿÿûûûÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËñññöööÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬";
GLubyte *grape_sel_brush_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÎßâÄÓÕ·ÄÆ³ÀÂ¿ÍÏÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÀÎĞ…‹‹ZZYHGE;86FEC•—ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÍÛŞ¡©©RON9410+(!..-)&¶ÃÅÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË¾ÊÌPMK51.   60-ÀÃÄÜëîÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË»ÇÉeffolkãââìëëËÏÏÕäæÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÌÎÏæäåøø÷ÚÙØÅÇÆÓáäØìñÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË¾ÄÅ¿½½ïïïôôòÌÍÎ¿¿¾ÔßßÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÊÔÖ¯¯¯ÏÏÏ÷÷÷çñø€@ €@ ÚææÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË²µ¶³´·Şàâ€@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÁÈÉ€@ €@ €@ €@ €@ €@ ØèêÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËØçè€@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÖåç€@ €@ €@ €@ €@ €@ ÙèëÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÙèê€@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÖåç€@ €@ €@ €@ €@ ÚãŞÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË×åæ€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÖãä€@ €@ €@ €@ ÜİÓÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÖàß€@ €@ €@ ßÜÑÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÕÛÙ€@ ŞØÊÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_spray_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË´­¦´­¦ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÉï¢Òó´­¦´­¦ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÊäõÚÙËÚÙËÚÙËÚÙËÚÙËŒÉñÉï¢ÒóµÚó´­¦´­¦ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÊäõÚÙËÚÙËÚÙËÊäõÚÙËÚÙËÚÙË‰Éò¤ÕöºİõÁàò¼Şó¦Õğ´­¦´­¦ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËS£ÕS£ÕS£ÕÊäõÚÙËÚÙËÚÙËÚÙË‘Ëë¤ÔíªØï‰Äèk°ßo¯Ş’ÄïŒÀî´­¦´­¦ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÊäõS£ÕÊäõìéØS£ÕÚÙËÚÙËŒĞê£Ôñ¹Úğ‰ÅãS£Õ?Ñ's²X›Ë|Àå=²ä´­¦´­¦ÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËS£ÕÚÙËÚÙË©°º¤ÆÛ¶Ûó¼áùo°İE‹Í<xÄ.YŸ9€½d¸ğ=²ä´­¦ÚÙËÚÙËÚÙËïïï¬¬¬ÊäõS£ÕÊäõS£ÕìéØÊäõŞãÙ´´°¾ÁË¼ÎŞ±àó€ºå;x¸.Z¡.ZŸF—×E°ï ªèÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËS£ÕìéØS£ÕS£ÕÜìğ·¹¹ËÃÀÇÌÔ¡Ôî•Ğòk©×=„¹O¦ÜH±å.¦ÖÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÊäõìéØìéØÊäõÆÙéÜéò©°ºÊÈËÄÄÈÄÄÈ‚Âïu¾í`ºîA®å.¢áÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËS£ÕÊäõS£ÕÚÙËÚÙË›¢¦ty€ª§§´­¦¯¸l¥É8¯ç.£İÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÊäõÚÙËÚÙËÚÙËËÌÍ?BC#&*ª¨©²¬¦’••‚–¢BµÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÊäõÚÙËÚÙË‹ˆ•”“ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_line_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_parallel_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_square_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_circle_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_triangle_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_text_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_rectangle_icon= "ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬";
GLubyte *grape_sel_filled_circle_icon="¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïï  ";
GLubyte *grape_sel_filled_parallel_icon="¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïï  ";
GLubyte *grape_sel_filled_rectangle_icon="¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïï  ";
GLubyte *grape_sel_filled_square_icon= "¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïï  ";
GLubyte *grape_sel_filled_triangle_icon="¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ €@ €@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂ€@ ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬ÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂÚÙÂïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬  ";
GLubyte *grape_sel_filled_oval_icon="ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ €@ €@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";
GLubyte *grape_sel_oval_icon="ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙË€@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙË€@ €@ €@ ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬ÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËÚÙËïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïïïï";

GLubyte *grape_filled_oval_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_filled_triangle_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬  ";
GLubyte *grape_filled_square_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬  ";
GLubyte *grape_filled_rectangle_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬  ";
GLubyte *grape_filled_parallel_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬  ";
GLubyte *grape_filled_circle_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬  ";
GLubyte *grape_oval_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_pencil_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ @@ @@ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ @@ @@ @@Ë¬hÚÃ‚ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ @@Å«%áª.Ä¦1\\(,‹C®ØÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØØÅMÿŞi×É>©±8~¯5@š52‡K©Í¹ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ÷×CüâvÄÙu¦ÂR ¸:¯5B›47K¥Ñ³ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØßÚoºÅGÇÜ‡¾Õx¬¾M¦³=~¯4E›+.Š6²Ú¿ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ³ğ3‡­2¨¿KÂÛ†·Öw¬ÁLœº<ƒ°3L02ŠJÇ¬ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ³ğ3‹­. ½IÉÜ…ÀÔv§ÄP»6³;EA5ˆA«Ù¿ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ³ğ3†¬.¦ÂHÉÖ¢¿Òt²ÀC¡·:·/MŸ-.†IìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ³ğ3­1§ÃGÉÛ†¾Ò©ÁUœ½,‚³2ÿÿÿ\\qh«²²ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ³ğ3‰¯.¨ÃTÅÜ‘½Óx«ÀGÿÿÿ ¬V_]FGG¾»¼ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØ³ğ3‰­*¨Ã?Ëßwÿÿÿ¾Ã®¥ ®‘b__FCD¸·¸ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ³ğ3¯5ÿÿÿÑÙËÀ¿Æª¨ª©©©………999XXXìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÿÿÿ€€€‘”™ÄÃÍÅÄÆŸŸŸZZZXXXìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØXXX€€€˜— ¶¶¶rrrXXXìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØXXXXXXlllìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€€€ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_colorpick_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕÿ€¿ÿdËæäÕæäÕş§óş´ûù·şæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕü¡¼ÿoĞÿ}ßùœíß†ÓŞ™Úê©éî´øÓŸôæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕ÷»½ÿ…Ğı|ãş³üÕqÃ¾R«Î”Ìî°íæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕïÑÀü¡Óı~ã÷šøÿÿÿëëëÌzÃæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕããĞ÷»Ûÿ”éñ€ğÿÿÿëëë¿F¨æäÕæäÕæäÕæäÕæäÕæäÕæäÕëçÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕëëëÿÿÿëëëæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÔæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕÿÿÿëëëßâàæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕÿÿÿëëëæäÕæäÕæäÕæäÕæäÕæäÕçåÖæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕÿÿÿëëëØÓàÑÕÒÚÚÓæäÕæäÕæäÕçå×æäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕéëìÿÿÿ˜—™hfgØÖËğîäæäÕæäÕçå×æäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕááÔ˜—™   KKO56:   ìêÛéçØèæ×æäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕéç×ŞÜĞ         .!'   ëéİçåÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕğîŞ            ˜—™îìÜæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕèæÖáßÒ¸·¬         âàÓèæ×æäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕèåÖôòáÄÃ»   !.!—–ñïßæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕéç×××Í‰ŠJGJ™•ñïßæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕèæ×ÖÕÊÅÃºãáÒçåÖæäÕçåÖæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕæäÕ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_eraser_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØÁÁÁìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ´´´‘‘‘¡¡¡âââìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ©©ª““•££¥ÁÁÄÂÂÄÍÍÎìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØªªª‘‘’¤¤¦ÅÅÇÔÔÖ××ÙÈÈÈÎÎÎìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ¨¨¨¢¢¤ÇÇÉÕÕ×ÍÍÍØØÚİİİÍÍÍÑÑÑìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÄÄÄ‹‹‹¤¤¤ÆÆÈÔÔÖÍÍÍØØÛÍÍÍŞŞŞåååÕÕÕÓÓÓìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØççç¢¢¢ÆÆÆÕÕÖÍÍÍØØÙÍÍÍßßàÍÍÍåååëëëÜÜÜØØØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØÚÚÚÅÅÅ×××ÙÙÙÍÍÍßßßâââåååèèèëëëñññäääÛÛÛìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØÙÙÙÍÍÍİİİßßßÍÍÍæææéééìììÿÿÿğğğ÷÷÷êêêÚÚÚìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØßßßÔÔÔãããåååèèèëëëîîîñññôôôÿÿÿûûûôôôİİİìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØâââÛÛÛêêêìììÿÿÿñññÿÿÿ÷÷÷ùùùüüüÿÿÿìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØèèèßßßïïïòòòïïï÷÷÷úúúÿÿÿşşşÿÿÿìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØèèèèèèïïïÿÿÿùùùÿÿÿşşşÿÿÿúúúìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØííííííûûûüüüÿÿÿÿÿÿúúúìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØğğğñññşşşÿÿÿûûûìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØñññöööìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_brush_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØÎßâÄÓÕ·ÄÆ³ÀÂ¿ÍÏìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÀÎĞ…‹‹ZZYHGE;86FEC•—ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÍÛŞ¡©©RON9410+(!..-)&¶ÃÅìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ¾ÊÌPMK51.60-ÀÃÄÜëîìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ»ÇÉeffolkãââìëëËÏÏÕäæìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØÌÎÏæäåøø÷ÚÙØÅÇÆÓáäØìñìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ¾ÄÅ¿½½ïïïôôòÌÍÎ¿¿¾ÔßßìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØÛíğÊÔÖ¯¯¯ÏÏÏ÷÷÷çñø€@ €@ ÚææìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØØçê²µ¶³´·Şàâ€@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØÛîñÁÈÉ€@ €@ €@ €@ €@ €@ ØèêìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØØçè€@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØÖåç€@ €@ €@ €@ €@ €@ ÙèëìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÙèê€@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÖåç€@ €@ €@ €@ €@ ÚãŞìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ×åæ€@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÖãä€@ €@ €@ €@ ÜİÓìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÖàß€@ €@ €@ ßÜÑìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÕÛÙ€@ ŞØÊìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_spray_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ´­¦´­¦ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÉï¢Òó´­¦´­¦ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØÊäõìéØìéØìéØìéØìéØŒÉñÉï¢ÒóµÚó´­¦´­¦ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÊäõìéØìéØìéØÊäõìéØìéØìéØ‰Éò¤ÕöºİõÁàò¼Şó¦Õğ´­¦´­¦ìéØìéØìéØìéØ¬¬¬ïïïìéØS£ÕS£ÕS£ÕÊäõìéØìéØìéØìéØ‘Ëë¤ÔíªØï‰Äèk°ßo¯Ş’ÄïŒÀî´­¦´­¦ìéØìéØìéØ¬¬¬ïïïìéØÊäõS£ÕÊäõìéØS£ÕìéØìéØŒĞê£Ôñ¹Úğ‰ÅãS£Õ?Ñ's²X›Ë|Àå=²ä´­¦´­¦ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØS£ÕìéØìéØ©°º¤ÆÛ¶Ûó¼áùo°İE‹Í<xÄ.YŸ9€½d¸ğ=²ä´­¦ìéØìéØìéØ¬¬¬ïïïÊäõS£ÕÊäõS£ÕìéØÊäõŞãÙ´´°¾ÁË¼ÎŞ±àó€ºå;x¸.Z¡.ZŸF—×E°ï ªèìéØìéØìéØìéØ¬¬¬ïïïìéØìéØS£ÕìéØS£ÕS£ÕÜìğ·¹¹ËÃÀÇÌÔ¡Ôî•Ğòk©×=„¹O¦ÜH±å.¦ÖìéØìéØìéØìéØìéØ¬¬¬ïïïìéØÊäõìéØìéØÊäõÆÙéÜéò©°ºÊÈËÄÄÈÄÄÈ‚Âïu¾í`ºîA®å.¢áìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØS£ÕÊäõS£ÕìéØìéØ›¢¦ty€ª§§´­¦¯¸l¥É8¯ç.£İìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÊäõìéØìéØìéØËÌÍ?BC#&*ª¨©²¬¦’••‚–¢BµìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØÊäõìéØìéØ‹ˆ•”“ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_line_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_parallel_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_square_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_circle_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_triangle_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_text_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ ìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØ€@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ ìéØìéØìéØìéØ€@ €@ €@ €@ €@ ìéØìéØìéØìéØ€@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_rectangle_icon= "ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ ìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ€@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ€@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ €@ ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";

GLubyte *grape_trans_off_icon="......................................................................................................................................................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ......................................................................................................................................................";
GLubyte *grape_trans_on_icon="......................................................................................................................................................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.........ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.....................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.....................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ...........................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ...........................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ...........................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.....................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.....................ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ.........ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ............ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ......................................................................................................................................................";
GLubyte *grape_undo_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆØâíìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØÑåğ+aÆìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ7mÔ+aÆæëóìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆÛèîìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆ+aÆÃÑæ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØ¬¬¬ïïïìéØ+aÆ+aÆÏÙæìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØ¬¬¬ïïïìéØ+aÆÎÙèìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆÌØíìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØİçï+aÆ;oÕ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_redo_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØØâí+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ+aÆÑåğìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØæëó+aÆ7mÔìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØÛèî+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆÃÑæ+aÆ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØÏÙæ+aÆ+aÆìéØ¬¬¬ïïïìéØìéØìéØìéØÌØí+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆ+aÆìéØìéØìéØìéØÎÙè+aÆìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØ+aÆ+aÆ+aÆ+aÆ+aÆ;oÕ+aÆİçïìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_new_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---------------------------------------ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---äääääääääääääääääääääääääääääääää---ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---ääääääääääääääääää------------------ìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---ääääääääääääääääää---ÀÀÀÀÀÀÀÀÀ---ìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---ääääääääääääääääää---ÀÀÀÀÀÀ---ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---ääääääääääääääääää---ÀÀÀ---ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ---ääääääääääääääääää------ìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ------------------------ìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïìéØìéØïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_zoomout_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¦ƒ½yYìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¥ƒ¼xZå“Fü´SìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¥ƒºwXæ“Eû´RûÇ}ìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¢ƒ’·tWå‘Bü´QúÆ{ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ €‘³qUæ@ÿµQûÆyìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬£²pUå?ş´QûÇzìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ¯·Ñª»Ö¬ÀÙ¢¸Ñ–¬Ë”¥É¬³Î»¼Åœ—–Ë™oü·\\ûÆvìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØº½Ğµ»ÔÊÛèÕó÷ØûüÖşşÉöú¹áñ¡¿à‹˜¿”—«ÒÏÉòÖ­ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÀÁÑ³»Òæëòøşşêÿÿãÿÿ,,,ĞÿÿÈùÿ¾íû¢Âæ“ÇÔ×ŞìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ¨±ÉÌßêöışşÿÿøÿÿëÿÿ,,,ÒşÿÂõÿ½ïÿ¼êûµÜ½¿ØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ£¶ÎÔôøìÿÿøÿÿùÿÿîÿÿ,,,ÒşÿÂõÿ³æÿ¾ïÿ³×î¤«ÒìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ¼ÀÒ«Ä×Ôûıäÿÿìÿÿîÿÿéÿÿ,,,Ğşÿ¾òÿ¬ßÿ·èÿÂğù›¥ÍìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ½ÂÔ­ÊİÒşş,,,,,,,,,,,,,,,,,,,,,,,,,,,Çùş™£ÊìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ¹¼Ñ ºÖÇ÷üĞÿÿÕÿÿÖÿÿÒÿÿ,,,Âõÿµçÿ¹æÿÅñÿÄôûš¥ÌìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ•ªÍ½ìúÄöÿÅøÿÇùÿÁóÿ,,,´æÿ²ßÿÊêÿÚúÿ½İî¦­ĞìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØŸªÉ¨ÌéÀòş¸ëÿ³åÿ¯áÿ,,,ºåÿÜğÿúıÿìùü®ÀÜ¿À×ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ”¨Ñ­Ôò½ïş¶èÿ­àÿ,,,ÊïÿêøÿöùûËÔæ®´ÑìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ˜ªÔ¨Èé¼éù¿ïıÂñşÊïúĞãï¾ÇÜ³¸ĞìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ¬´Ò¡²Ø£ºÜ ¶Õ™­Ì«Ê´¸ÏìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte *grape_zoomin_icon="ïïï¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¦ƒ½yYìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¥ƒ¼xZå“Fü´SìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¥ƒºwXæ“Eû´RûÇ}ìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¢ƒ’·tWå‘Bü´QúÆ{ìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ €‘³qUæ@ÿµQûÆyìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬£²pUå?ş´QûÇzìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ¯·Ñª»Ö¬ÀÙ¢¸Ñ–¬Ë”¥É¬³Î»¼Åœ—–Ë™oü·\\ûÆvìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØº½Ğµ»ÔÊÛèÕó÷ØûüÖşşÉöú¹áñ¡¿à‹˜¿”—«ÒÏÉòÖ­ìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØÀÁÑ³»ÒæëòøşşêÿÿĞÿÿĞÿÿĞÿÿÈùÿ¾íû¢Âæ“ÇÔ×ŞìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ¨±ÉÌßêöışşÿÿĞÿÿĞÿÿĞÿÿĞÿÿÂõÿ½ïÿ¼êûµÜ½¿ØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ£¶ÎÔôøìÿÿøÿÿĞÿÿĞÿÿĞÿÿĞÿÿÂõÿ³æÿ¾ïÿ³×î¤«ÒìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ¼ÀÒ«Ä×ÔûıäÿÿìÿÿîÿÿĞÿÿĞÿÿĞşÿ¾òÿ¬ßÿ·èÿÂğù›¥ÍìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ½ÂÔ­ÊİÒşşĞÿÿ,,,,,,,,,,,,,,,,,,,,,ĞÿÿÇùş™£ÊìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØ¹¼Ñ ºÖÇ÷üĞÿÿÕÿÿÖÿÿĞÿÿĞÿÿÂõÿµçÿ¹æÿÅñÿÄôûš¥ÌìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØ•ªÍ½ìúÄöÿÅøÿĞÿÿĞÿÿĞÿÿĞÿÿ²ßÿÊêÿÚúÿ½İî¦­ĞìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØŸªÉ¨ÌéÀòş¸ëÿĞÿÿĞÿÿĞÿÿĞÿÿÜğÿúıÿìùü®ÀÜ¿À×ìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØ”¨Ñ­Ôò½ïş¶èÿĞÿÿĞÿÿÊïÿêøÿöùûËÔæ®´ÑìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØ˜ªÔ¨Èé¼éù¿ïıÂñşÊïúĞãï¾ÇÜ³¸ĞìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØ¬´Ò¡²Ø£ºÜ ¶Õ™­Ì«Ê´¸ÏìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØìéØ¬¬¬ïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïïï¬¬¬¬¬¬";
GLubyte pixels[3];
//GLubyte *grape_pencil_icon="
// id's for  menus
int file_menu,edit_menu,help_menu,tools_menu;int typ1_menu,thik1_menu,line_menu;


struct color
{
	GLubyte r,g,b;
}cur_color,bkgnd_color;



struct save
{
	int pts[3][2],c,type,ptsise,wide;
	int t_strt,t_end;
	int f_strt,f_end;
	int funcsel;
	struct color poly_color;
}saved_data[200];
int data_c=0;//index to saved_data[]

int undo_c=0,undo_f=0;

int freehand_save_pts[10000][2];//to save pts drawn
int freehand_strtend=0;//index to freehand_save_pts[][]

unsigned char text_saved[60];//save txt
int text_strtend=0;//index to text_saved[]

int intermediate_chng_mouse_pos_for_txt=0;//once text is selected and typed,the change in text pos should be recorded as a new item in saved_data.1,if mouse clicked
int text_color_change=0;//indicates if color could be changed or not when funcsel=9,text.colour change is permitted only after the mouse click(intermediate click also)bcoz color change cannotbe recorded

int transparency=0,bkgnd_active=0;//to enable or disable transparency suitably.to change bkgrnd suitably
GLubyte alpha=170;//transparency extent

GLfloat zoom=1.0;
int cursor=1;//for blinking cursor
int new_line=35;//the shift in y-axis when \n is pressed 

int funcsel=1,fun,type=1,wide=1;
int text_first=0;
double pts[3][2];
int c=0;//x_drag,y_drag,drag=0;

char* menu="File  Edit  tools ",*menu_s;
char* color_p="transparency     background color",*color_ps;
int pencil_line=1,x_pencil,y_pencil;//used to make pencil look continuous.when 1,does not draw line

void redisplay(int x,int y);
void save_freehand(void);
void draw_icons(void);
void reddes(void);
void display(void);
void myinit(void);
//void save_text(int x,int y);

grape_new()
{
	
	data_c=0;
	freehand_strtend=0;
	zoom=1.0;
	new_line=35;
	text_first=0;
	c=0;
	text_strtend=0;
	pencil_line=0;
	bkgnd_color.r=255;
	bkgnd_color.g=255;
	bkgnd_color.b=255;
	draw_icons();
	glutPostRedisplay();
}
f_menu(int id)
{
	if(id==1)
		grape_new();
	else
		exit(0);
	glutPostRedisplay();
}
void undo()
{
	if(funcsel==11)
		if( funcsel==11)//saved_data[data_c-1].f_end==freehand_strtend-1 &&
			save_freehand();
	glutSetCursor(GLUT_CURSOR_LEFT_ARROW);
		if(data_c>0)
		{	
			data_c--;
			reddes();
			undo_c++;
		}
	undo_f=1;
	
}
redo()
{
	if(undo_c>0 ||undo_f)
		{	
			data_c++;
			saved_data[data_c].f_strt++;
	
			reddes();
			
			undo_c--;
		}
}
e_menu(int id)
{
	if(id==1)
		undo();
	else
		redo();
}
t_menu(int id)
{
	if(id==1)
		zoom-=0.2;		
	else
		zoom+=0.2;
	redisplay(win_x,win_y);

	glutPostRedisplay();
}

set_vp_icons()
{
	glMatrixMode(GL_PROJECTION);
	glLoadIdentity();
	glOrtho(0,win_x,0,win_y,-50,1);
	glMatrixMode(GL_MODELVIEW);
	glLoadIdentity();
}

set_vp_draw()
{
	glMatrixMode(GL_PROJECTION);
	glLoadIdentity();
	glOrtho(0,win_x-58,0,win_y-52-40,-50,0);
	glMatrixMode(GL_MODELVIEW);
	glLoadIdentity();
}
void manage_icons(int x,int y)//passive motion function
{
	glutDetachMenu(GLUT_LEFT_BUTTON);
	if(funcsel==11 && pencil_line!=1)
	{
		pencil_line=1;//to discontinue hree hand draw,since line_strip is used
		saved_data[data_c-1].f_end=freehand_strtend-1;
		saved_data[data_c].funcsel=11;
		save_freehand();
	}
	if(win_y-y<=40 || win_y-y>=win_y-52 || x<=58)
	{
		glutSetCursor(GLUT_CURSOR_LEFT_ARROW);
	}
	else if(funcsel==9)
		glutSetCursor(GLUT_CURSOR_TEXT);
	else if(funcsel==1)
	{
		glutSetMenu(line_menu);
		glutAttachMenu(GLUT_RIGHT_BUTTON);
	}
	else
		glutSetCursor(GLUT_CURSOR_LEFT_ARROW);
	if(x>=3 && x<=43 && win_y-y<=win_y-2 && win_y-y>=win_y-21)
	{
		glutSetMenu(file_menu);
		glutAttachMenu(GLUT_LEFT_BUTTON);
	}
	if(x>=46 && x<=86 && win_y-y<=win_y-2 && win_y-y>=win_y-21)
	{
		glutSetMenu(edit_menu);
		glutAttachMenu(GLUT_LEFT_BUTTON);
	}
	if(x>=89 && x<=139 && win_y-y<=win_y-2 && win_y-y>=win_y-21)
	{
		glutSetMenu(tools_menu);
		glutAttachMenu(GLUT_LEFT_BUTTON);
	}

}

highlighted_color()
{
	glColor3ub(cur_color.r,cur_color.g,cur_color.b);
	glBegin(GL_POLYGON);//highlighted color
	glVertex2f(10,10);
	glVertex2f(30,10);
	glVertex2f(30,30);
	glVertex2f(10,30);
	glEnd();

	glBegin(GL_LINE_STRIP);//border of highlighted color
	glColor3b(70,70,70);//40,40,40
	glVertex2f(10,10);
	glVertex2f(10,30);
	glVertex2f(30,30);
	glEnd();
	glBegin(GL_LINE_STRIP);//border of highlighted color
	glColor3f(0.9,0.9,0.9);
	glVertex2f(10,10);
	glVertex2f(30,10);
	glVertex2f(30,30);
	glEnd();
	glColor3ub(cur_color.r,cur_color.g,cur_color.b);
}
DrawInitialMenu()
{
	glColor3ub(236,233,216);//background colour
	glBegin(GL_POLYGON);
	glVertex2f(0,win_y-52);
	glVertex2f(0,win_y);
	glVertex2f(win_x,win_y);
	glVertex2f(win_x,win_y-52);
	glEnd();
	glColor3ub(205,215,192);//highlighting
	glBegin(GL_LINES);
	glVertex2f(0,win_y-50);
	glVertex2f(win_x,win_y-50);
	glEnd();
	glBegin(GL_LINES);
	glVertex2f(0,win_y-23);
	glVertex2f(win_x,win_y-23);
	glEnd();
	
	

	glColor3b(0,0,0);


	menu_s=menu;//menu is a string whose address is incremented within the loop
	glRasterPos2d(7,win_y-15);
  	while((*menu)!=NULL)
	{
		glutBitmapCharacter(GLUT_BITMAP_8_BY_13,*menu);
		menu++;
	}
	//bounding boxes for menu bar
	glColor3ub(200,200,200);
	glBegin(GL_LINE_STRIP);
	glVertex2f(3,win_y-21);
	glVertex2f(3,win_y-2);
	glVertex2f(43,win_y-2);
	glEnd();
	glColor3ub(173,173,173);
		glBegin(GL_LINE_STRIP);
	glVertex2f(3,win_y-21);
	glVertex2f(43,win_y-21);
	glVertex2f(43,win_y-2);
	//glVertex2f(43,win_y-21);
	glEnd();
	glFlush();

	glColor3ub(200,200,200);
	glBegin(GL_LINE_STRIP);
	glVertex2f(50,win_y-21);
	glVertex2f(50,win_y-2);
	glVertex2f(91,win_y-2);
	glEnd();
	glColor3ub(173,173,173);
	
	glBegin(GL_LINE_STRIP);
	glVertex2f(50,win_y-21);
	glVertex2f(91,win_y-21);
	glVertex2f(91,win_y-2);
	//glVertex2f(43,win_y-21);
	glEnd();
	glFlush();

	glColor3ub(200,200,200);
	glBegin(GL_LINE_STRIP);
	glVertex2f(97,win_y-21);
	glVertex2f(97,win_y-2);
	glVertex2f(147,win_y-2);
	glEnd();
	glColor3ub(173,173,173);
	
	glBegin(GL_LINE_STRIP);
	glVertex2f(97,win_y-21);
	glVertex2f(147,win_y-21);
	glVertex2f(147,win_y-2);
	//glVertex2f(43,win_y-21);
	glEnd();
	glFlush();

	
	menu=menu_s;
	glRasterPos2d(3,win_y-50);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_new_icon);
	glRasterPos2d(30,win_y-50);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_undo_icon);
	glRasterPos2d(57,win_y-50);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_redo_icon);
	glRasterPos2d(84,win_y-50);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_zoomin_icon);
	glRasterPos2d(111,win_y-50);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_zoomout_icon);

}
display_sel(int funcsel)
{
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	switch(funcsel)
	{
		case 11:glRasterPos2d(4,win_y-79);
			   glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_pencil_icon);
			   break;
		case 2:glRasterPos2d(31,win_y-79);
			   glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_eraser_icon);
			   break;
		case 12:glRasterPos2d(4,win_y-106);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_brush_icon);
				break;
		case 13:glRasterPos2d(31,win_y-106);
			    glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_spray_icon);
				break;
		case 14:glRasterPos2d(4,win_y-133);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_colorpick_icon);
				break;
		case 1:	glRasterPos2d(31,win_y-133);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_line_icon);
				break;
		case 3:	glRasterPos2d(4,win_y-160);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_parallel_icon);
				break;
		case 4: glRasterPos2d(4,win_y-187);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_square_icon);
				break;
		case 6:	glRasterPos2d(4,win_y-214);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_circle_icon);
				break;
		case 7:	glRasterPos2d(4,win_y-241);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_triangle_icon);
				break;
		case 9:	glRasterPos2d(4,win_y-322);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_text_icon);
				break;
		case 5:	glRasterPos2d(4,win_y-268);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_rectangle_icon);
				break;
		case 15:glRasterPos2d(31,win_y-160);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_parallel_icon);
				break;
		case 16:glRasterPos2d(31,win_y-187);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_square_icon);
				break;
		case 17:glRasterPos2d(31,win_y-214);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_circle_icon);
				break;
		case 18:glRasterPos2d(31,win_y-241);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_triangle_icon);
				break;
		case 19:glRasterPos2d(31,win_y-268);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_rectangle_icon);
				break;
		case 20:glRasterPos2d(4,win_y-295);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_oval_icon);
				break;
		case 21:glRasterPos2d(31,win_y-295);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_filled_oval_icon);
				break;
	}
	glPopMatrix();
}
DrawInitialTools()
{
	glColor3ub(236,233,216);//boundary
	glBegin(GL_POLYGON);
	glVertex2f(0,40);
	glVertex2f(58,40);
	glVertex2f(58,win_y-51);
	glVertex2f(0,win_y-51);
	glEnd();
	glColor3ub(205,215,192);//highlighting
	glBegin(GL_LINES);
	glVertex2f(58,40);
	glVertex2f(58,win_y-53);
	glEnd();
	glRasterPos2d(4,win_y-79);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_pencil_icon);
	glRasterPos2d(31,win_y-79);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_eraser_icon);
	glRasterPos2d(4,win_y-106);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_brush_icon);
	glRasterPos2d(31,win_y-106);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_spray_icon);
	glRasterPos2d(4,win_y-133);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_colorpick_icon);
	glRasterPos2d(31,win_y-133);
	
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_sel_line_icon);
	
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_line_icon);
	glRasterPos2d(4,win_y-160);	
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_parallel_icon);
	glRasterPos2d(31,win_y-160);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_parallel_icon);
	glRasterPos2d(4,win_y-187);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_square_icon);
	glRasterPos2d(31,win_y-187);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_square_icon);
	glRasterPos2d(4,win_y-214);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_circle_icon);
	glRasterPos2d(31,win_y-214);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_circle_icon);
	glRasterPos2d(4,win_y-241);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_triangle_icon);
	glRasterPos2d(31,win_y-241);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_triangle_icon);
	glRasterPos2d(4,win_y-268);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_rectangle_icon);
	glRasterPos2d(31,win_y-268);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_rectangle_icon);
	glRasterPos2d(4,win_y-322);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_text_icon);
	glRasterPos2d(4,win_y-295);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_oval_icon);
	glRasterPos2d(31,win_y-295);
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_oval_icon);
	display_sel(funcsel);
}
highlight_colors(int x,int y)
{
	//glColor3b(85,85,85);
	glColor3b(65,65,65);
	glBegin(GL_LINE_STRIP);
	glVertex2f(x,y);
	glVertex2f(x,y+15-1);
	glVertex2f(x+15,y+15-1);
	glEnd();
	
}


DrawColorPallette()
{
	GLubyte r=236,g=233,b=216;
	glColor3ub(r,g,b);//background
	glBegin(GL_POLYGON);
	glVertex2f(0,0);
	glVertex2f(0,40);
	glVertex2f(win_x,40);
	glVertex2f(win_x,0);
	glEnd();

	glColor3b(98,107,84);//borderline
	glBegin(GL_LINES);
	glVertex2f(0,40);
	glVertex2f(win_x,40);
	glEnd();

	highlighted_color();

	glColor3ub(0,0,0);//colors squares 15x15
	glBegin(GL_POLYGON);
	glVertex2f(40,5);
	glVertex2f(55,5);
	glVertex2f(55,20);
	glVertex2f(40,20);
	glEnd();

	
	glColor3ub(0,0,255);
	glBegin(GL_POLYGON);
	glVertex2f(58,5);
	glVertex2f(73,5);
	glVertex2f(73,20);
	glVertex2f(58,20);
	glEnd();
	highlight_colors(58,5);
	
	glColor3ub(0,255,0);
	glBegin(GL_POLYGON);
	glVertex2f(40,23);
	glVertex2f(55,23);
	glVertex2f(55,38);
	glVertex2f(40,38);
	glEnd();
	highlight_colors(40,23);
	
	glColor3ub(0,255,255);
	glBegin(GL_POLYGON);
	glVertex2f(58,23);
	glVertex2f(73,23);
	glVertex2f(73,38);
	glVertex2f(58,38);
	glEnd();
	highlight_colors(58,23);
	
	glColor3ub(255,0,0);
	glBegin(GL_POLYGON);
	glVertex2f(76,5);
	glVertex2f(91,5);
	glVertex2f(91,20);
	glVertex2f(76,20);
	glEnd();
	highlight_colors(76,5);
	
	glColor3ub(255,0,255);
	glBegin(GL_POLYGON);
	glVertex2f(76,23);
	glVertex2f(91,23);
	glVertex2f(91,38);
	glVertex2f(76,38);
	glEnd();
	highlight_colors(76,23);
	
	glColor3ub(255,255,0);
	glBegin(GL_POLYGON);
	glVertex2f(94,5);
	glVertex2f(109,5);
	glVertex2f(109,20);
	glVertex2f(94,20);
	glEnd();
	highlight_colors(94,5);

	glColor3ub(255,255,255);
	glBegin(GL_POLYGON);
	glVertex2f(94,23);
	glVertex2f(109,23);
	glVertex2f(109,38);
	glVertex2f(94,38);
	glEnd();
	highlight_colors(94,23);

	glColor3ub(196,98,0);//brown
	glBegin(GL_POLYGON);
	glVertex2f(112,5);
	glVertex2f(127,5);
	glVertex2f(127,20);
	glVertex2f(112,20);
	glEnd();
	highlight_colors(112,5);
	
	glColor3ub(0,128,0);//to make the color(green) more darker,decrease the g parameter
	glBegin(GL_POLYGON);
	glVertex2f(112,23);
	glVertex2f(127,23);
	glVertex2f(127,38);
	glVertex2f(112,38);
	glEnd();
	highlight_colors(112,23);

	glColor3ub(255,121,188);//pink
	glBegin(GL_POLYGON);
	glVertex2f(130,5);
	glVertex2f(145,5);
	glVertex2f(145,20);
	glVertex2f(130,20);
	glEnd();
	highlight_colors(130,5);
	
	glColor3ub(255,128,64);//orange
	glBegin(GL_POLYGON);
	glVertex2f(130,23);
	glVertex2f(145,23);
	glVertex2f(145,38);
	glVertex2f(130,38);
	glEnd();
	highlight_colors(130,23);
	glRasterPos2d(160,10);
	if(transparency==0)
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_off_icon);
	else
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_on_icon);
	glRasterPos2d(295,10);
	if(bkgnd_active==0)
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_off_icon);
	else
	glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_on_icon);
	glColor3f(0.0,0.0,0.0);
	glRasterPos2d(187,16);
	color_ps=color_p;
	
	while((*color_ps)!=NULL)
	{
		glutBitmapCharacter(GLUT_BITMAP_8_BY_13 ,*color_ps);
		color_ps++;
	}
}
void draw_icons(void)
{
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	glColor3ub(bkgnd_color.r,bkgnd_color.g,bkgnd_color.b);
	glBegin(GL_POLYGON);
	glVertex2d(0,0);
	glVertex2d(win_x,0);
	glVertex2d(win_x,win_y);
	glVertex2d(0,win_y);
	glEnd();
	DrawInitialMenu();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	DrawInitialTools();
	DrawColorPallette();
	glPopMatrix();
}
void save_freehand()
{
	saved_data[data_c].funcsel=funcsel;
	saved_data[data_c].poly_color.r=cur_color.r;
	saved_data[data_c].poly_color.g=cur_color.g;
	saved_data[data_c].poly_color.b=cur_color.b;
	saved_data[data_c-1].f_end=freehand_strtend-1;
	saved_data[data_c++].f_strt=freehand_strtend;
}




erase(int x,int y)
{
	if(x>=67 && win_y-y>=51 && win_y-y<=win_y-61)
	{
	glPointSize(20.0);
	glColor3f(1.0,1.0,1.0);
	glBegin(GL_POINTS);
	glVertex3d(x-58,win_y-y-40,0);
	glEnd();
	glFlush();
	glColor3b(cur_color.r,cur_color.g,cur_color.b);
	glPointSize(1.0);
	}
}
pencil(int x,int  y)
{	
	if(pencil_line)
	{
		x_pencil=x;y_pencil=y;
		glBegin(GL_POINTS);
		glVertex3f(x-58,win_y-y-40,0);
		pencil_line=0;
	}
	else
	{
		glBegin(GL_LINES);
		glVertex3f(x-58,win_y-y-40,0);
		glVertex3f(x_pencil-58,win_y-y_pencil-40,0);
		x_pencil=x;y_pencil=y;
	}
	glEnd();
	glFlush();
}
spray(int x,int y)
{
	int n[7];
	glBegin(GL_POINTS);//spray
	n[0]=rand()%13;
	glVertex3d(x+n[0]-58,win_y+10-y-40,0);
	n[1]=rand()%15;
	glVertex3d(x+7-58,win_y+5-y+n[1]-40,0);
	n[2]=rand()%12;
	glVertex3d(x-1+n[2]-58,win_y+2-y-40,0);
	n[3]=rand()%3;
	glVertex3d(x-2+n[3]-58,win_y+7-y-40,0);
	n[4]=rand()%5;
	glVertex3d(x+11-58,win_y-y+n[4]-40,0);
	n[5]=rand()%17;
	glVertex3d(x+6-58,win_y+4-y-n[5]-40,0);
	n[6]=rand()%6;
	glVertex3d(x+1+n[6]-58,win_y-y-40,0);
	glEnd();
	glFlush();
}
brush(int x,int y)
{
	if(x>=67 && win_y-y>=51 && win_y-y<=win_y-61)
	{
		glPointSize(20.0);
		glBegin(GL_POINTS);
		glVertex3d(x-58,win_y-y-40,0);
		glEnd();
		glFlush();
		glPointSize(1.0);
	}
}

void mymotion(int x,int y)
{
	undo_c=0;undo_f=0;
	if((win_y-y<=40 || win_y-y>=win_y-52 || x<=58) &&(funcsel==11 ||funcsel==2||funcsel==13||funcsel==12))
	{
		glutSetCursor(help_menu);
	}
	else
		glutSetCursor(GLUT_CURSOR_LEFT_ARROW);
	glPushMatrix();
	set_vp_draw();
	glViewport(58,40,win_x-58,win_y-52-40);
	freehand_save_pts[freehand_strtend][0]=x;
	freehand_save_pts[freehand_strtend++][1]=y;
	glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	if(funcsel==2)//erase
	{
		erase(x,y);
		
	}
	if(funcsel==11)//pencil
	{
		pencil(x,y);
		
	}
	if(funcsel==13)//spray
	{
		//randomize();
		spray(x,y);
	}
	if(funcsel==12)//brush
	{
		brush(x,y);
	}
	glPopMatrix();
//	glColor4b(cur_color.r,cur_color.g,cur_color.b,alpha);
	glutSwapBuffers();
}
save_line()
{
		saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c].wide=wide;
		saved_data[data_c].type=type;
		saved_data[data_c++].pts[1][1]=pts[1][1];		
}
	
lines()
{
		glLineWidth(wide);
		if(type==2)
		{
			glLineStipple(1, 0x00FF);
			glEnable(GL_LINE_STIPPLE);
		}
		else if(type==3)
		{
			glLineStipple(1, 0x0C0F);
			glEnable(GL_LINE_STIPPLE);
		}
		glBegin(GL_LINES);
		glVertex3d(pts[c-2][0]-58,win_y-(pts[c-2][1])-40,0);
		glVertex3d(pts[c-1][0]-58,win_y-(pts[c-1][1])-40,0);
		glEnd();
		glFlush();
		glDisable(GL_LINE_STIPPLE);
		c--;
		c--;
}
save_parallelogram()
{
		saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c++].pts[1][1]=pts[1][1];
		saved_data[data_c].c=0;
}
parallelogram()
{
	float dist;				
	dist=sqrt(pow((pts[c-1][0]-pts[c-2][0]),2)+pow((pts[c-1][1]-pts[c-2][1]),2));
	if(funcsel==3)
		glBegin(GL_LINE_LOOP);
	else
		glBegin(GL_POLYGON);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-1][1])-40,0);
	glVertex3d((pts[c-1][0]-dist)-58,win_y-(pts[c-1][1])-40,0);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-2][0]+dist)-58,win_y-(pts[c-2][1])-40,0);
	glEnd();
	glFlush();
	c--;
	c--;	
}
save_square()
{
		saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c++].pts[1][1]=pts[1][1];

}
square()
{
	GLfloat dist=pts[c-1][0]-pts[c-2][0];
	if(funcsel==16)
		glBegin(GL_POLYGON);
	else
		glBegin(GL_LINE_LOOP);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-2][1]-dist)-40,0);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-2][1]-dist)-40,0);
	glEnd();
	glFlush();			
	c--;
	c--;				
}
save_circle()
{
	saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c++].pts[1][1]=pts[1][1];
}
circles()
{
	GLfloat i,r,x1,y1;			
	r=sqrt(pow((pts[c-1][0]-pts[c-2][0]),2)+pow((pts[c-1][1]-pts[c-2][1]),2));
	if(funcsel==6)
		glBegin(GL_LINE_STRIP);
	else
		glBegin(GL_POLYGON);
				for(i=-30;i<360;i+=0.25)
				{
				
					x1=(pts[c-2][0]-58)+r*cos(i*(22/7)/180);
					y1=(win_y-pts[c-2][1]-40)+r*sin(i*(22/7)/180);
					glVertex3d(x1,y1,0);
					
				}
				glEnd();
				glFlush();
				
				c--;
				c--;
				
}
save_oval()
{
	saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c++].pts[1][1]=pts[1][1];
}
oval()
{
	GLfloat i,a,b,x1,y1;			
	if(pts[c-2][0]>pts[c-1][0])
		a=(pts[c-2][0]-pts[c-1][0]);
	else
		a=(-pts[c-2][0]+pts[c-1][0]);

	if(pts[c-2][1]>pts[c-1][1])
		b=(pts[c-2][1]-pts[c-1][1]);
	else
		b=(-pts[c-2][1]+pts[c-1][1]);

	if(funcsel==20)
		glBegin(GL_LINE_STRIP);
	else
		glBegin(GL_POLYGON);
				for(i=-30;i<360;i+=0.25)
				{
				
					x1=(pts[c-2][0]-58)+a*cos(i*(22/7)/180);
					y1=(win_y-pts[c-2][1]-40)+b*sin(i*(22/7)/180);
					glVertex3d(x1,y1,0);
					
				}
				glEnd();
				glFlush();
				c--;
				c--;
				
}

save_rectangle()
{
		saved_data[++data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=2;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c++].pts[1][1]=pts[1][1];
}
rectangle()
{
	if(funcsel==19)
		glBegin(GL_POLYGON);
	else
		glBegin(GL_LINE_LOOP);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-1][1])-40,0);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-1][1])-40,0);
	glEnd();
	glFlush();
	c--;
	c--;			
}
save_triangle()
{
	saved_data[data_c].funcsel=funcsel;
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
		saved_data[data_c].c=3;
		saved_data[data_c].pts[0][0]=pts[0][0];
		saved_data[data_c].pts[0][1]=pts[0][1];
		saved_data[data_c].pts[1][0]=pts[1][0];
		saved_data[data_c].pts[1][1]=pts[1][1];
		saved_data[data_c].pts[2][0]=pts[2][0];
		saved_data[data_c++].pts[2][1]=pts[2][1];		
}
triangle()
{
	if(funcsel==18)
		glBegin(GL_TRIANGLES);
	else
		glBegin(GL_LINE_LOOP);
	glVertex3d((pts[c-1][0])-58,win_y-(pts[c-1][1])-40,0);
	glVertex3d((pts[c-2][0])-58,win_y-(pts[c-2][1])-40,0);
	glVertex3d((pts[c-3][0])-58,win_y-(pts[c-3][1])-40,0);
	glEnd();
	glFlush();
	c--;
	c--;
	c--;				
}

void select_color(GLint x,GLint y)//colour pallette
{
	y=win_y-y;
	if(funcsel==9)
	{
		glPopMatrix();
		glPushMatrix();
		if(cursor==0)
		{
		glViewport(58,40,win_x-58,win_y-52-40);
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		}
	}

	if(x>=40 && x<=55 && y>=5 && y<=20)//black
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=0;
			bkgnd_color.g=0;
			bkgnd_color.b=0;
			redisplay(win_x,win_y);
			
			glFlush();
			return;
		}
		cur_color.r=0;
		cur_color.g=0;
		cur_color.b=0;
		goto out;
	}
	if(x>=58 && x<=73 && y>=5 && y<=20)//d.blue
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=0;
			bkgnd_color.g=0;
			bkgnd_color.b=255;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=0;
		cur_color.g=0;
		cur_color.b=255;
		goto out;
	}
	if(x>=76 && x<=91 && y>=5 && y<=20)//red
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=255;
			bkgnd_color.g=0;
			bkgnd_color.b=0;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=0;
		cur_color.b=0;
		goto out;
	}
	if(x>=94 && x<=109 && y>=5 && y<=20)//yell
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.b=0;
			bkgnd_color.g=255;
			bkgnd_color.r=255;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=255;
		cur_color.b=0;
		goto out;
	}
	if(x>=112 && x<=127 && y>=5 && y<=20)//brown
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=196;
			bkgnd_color.g=98;
			bkgnd_color.b=0;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=196;
		cur_color.g=98;
		cur_color.b=0;
		goto out;
	}
	if(x>=130 && x<=145 && y>=5 && y<=20)//pink
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=255;
			bkgnd_color.g=121;
			bkgnd_color.b=188;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=121;
		cur_color.b=188;
		goto out;
	}
	if(x>=40 && x<=55 && y>=23 &&y<=38)//l.green
	{
		
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=0;
			bkgnd_color.g=255;
			bkgnd_color.b=0;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=0;
		cur_color.g=255;
		cur_color.b=0;
		goto out;
	}
	if(x>=58 && x<=73&& y>=23 &&y<=38)//l.blue
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=0;
			bkgnd_color.g=255;
			bkgnd_color.b=255;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=0;
		cur_color.g=255;
		cur_color.b=255;
		goto out;
	}
	if(x>=76 && x<=91&& y>=23 &&y<=38)//megenta
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=255;
			bkgnd_color.g=0;
			bkgnd_color.b=255;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=0;
		cur_color.b=255;
		goto out;
	}
	if(x>=94 && x<=109 && y>=23 &&y<=38 )//white
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=255;
			bkgnd_color.g=255;
			bkgnd_color.b=255;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=255;
		cur_color.b=255;
		goto out;
	}
	if(x>=112 && x<=127 && y>=23 &&y<=38)//green
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=0;
			bkgnd_color.g=128;
			bkgnd_color.b=0;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=0;
		cur_color.g=128;
		cur_color.b=0;
		goto out;
	}
	if(x>=130 && x<=145&& y>=23 &&y<=38 )//orange
	{
		c=0;
		if(bkgnd_active==1)
		{
			bkgnd_color.r=255;
			bkgnd_color.g=128;
			bkgnd_color.b=64;
			redisplay(win_x,win_y);
			glFlush();
			return;
		}
		cur_color.r=255;
		cur_color.g=128;
		cur_color.b=64;
		goto out;
	}
	out:
	if(funcsel==9)
	{
		
		set_vp_icons();
		glViewport(0,0,win_x,win_y);
		highlighted_color();
	
	}
	else
	{
		set_vp_icons();
		glViewport(0,0,win_x,win_y);
		highlighted_color();
	}
	if(funcsel==2 || funcsel==11 || funcsel==13 || funcsel==12)
	{
			saved_data[data_c].funcsel=funcsel;
			save_freehand();
		
	}
		saved_data[data_c].poly_color.r=cur_color.r;
		saved_data[data_c].poly_color.g=cur_color.g;
		saved_data[data_c].poly_color.b=cur_color.b;
	glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	glutSwapBuffers();
}
display_unsel(int funcsel)
{
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	switch(funcsel)
	{
		case 11:glRasterPos2d(4,win_y-79);
			   glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_pencil_icon);
			   break;
		case 2:glRasterPos2d(31,win_y-79);
			   glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_eraser_icon);
			   break;
		case 12:glRasterPos2d(4,win_y-106);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_brush_icon);
				break;
		case 13:glRasterPos2d(31,win_y-106);
			    glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_spray_icon);
				break;
		case 14:glRasterPos2d(4,win_y-133);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_colorpick_icon);
				break;
		case 1:	glRasterPos2d(31,win_y-133);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_line_icon);
				break;
		case 3:	glRasterPos2d(4,win_y-160);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_parallel_icon);
				break;
		case 4: glRasterPos2d(4,win_y-187);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_square_icon);
				break;
		case 6:	glRasterPos2d(4,win_y-214);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_circle_icon);
				break;
		case 7:	glRasterPos2d(4,win_y-241);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_triangle_icon);
				break;
		case 9:	glRasterPos2d(4,win_y-322);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_text_icon);
				break;
		case 5:	glRasterPos2d(4,win_y-268);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_rectangle_icon);
				break;
		case 15:glRasterPos2d(31,win_y-160);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_parallel_icon);
				break;
		case 16:glRasterPos2d(31,win_y-187);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_square_icon);
				break;
		case 17:glRasterPos2d(31,win_y-214);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_circle_icon);
				break;
		case 18:glRasterPos2d(31,win_y-241);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_triangle_icon);
				break;
		case 19:glRasterPos2d(31,win_y-268);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_rectangle_icon);
				break;
		case 20:glRasterPos2d(4,win_y-295);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_oval_icon);
				break;
		case 21:glRasterPos2d(31,win_y-295);
				glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_filled_oval_icon);
				break;
	}
	glPopMatrix();
}

select_fun(int x,int y)
{
	y=win_y-y;
	c=0;
	glutSetCursor(GLUT_CURSOR_LEFT_ARROW);
	text_color_change=0;//can change color
	if(funcsel==2 ||funcsel ==11 ||funcsel==12||funcsel==13)
			saved_data[data_c-1].f_end=freehand_strtend-1;
	if(funcsel==9)
	{
		glPopMatrix();
		if(cursor==0)
		{
		glViewport(58,40,win_x-58,win_y-52-40);
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		}
		glLogicOp(GL_COPY);

		glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
		intermediate_chng_mouse_pos_for_txt=0;//for saving.data_c need not be inc in text func
		saved_data[data_c++].t_end=text_strtend-1;
		glPopMatrix();
		text_first=0;
	}
	glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	display_unsel(funcsel);
	glPopMatrix();
	if(x>=4 && x<=28&& y>=win_y-79 &&y<=win_y-55 )
	{
		funcsel=11;
		saved_data[data_c].funcsel=11;
		save_freehand();
	}
	if(x>=31 && x<=55 && y>=win_y-79 &&y<=win_y-55 )
	{
		funcsel=2;
		saved_data[data_c].funcsel=2;
		save_freehand();
	}
	if(x>=4 && x<=28 && y>=win_y-106 &&y<=win_y-82 )
	{
		funcsel=12;
		saved_data[data_c].funcsel=12;
		save_freehand();
	}
	if(x>=31 && x<=55 && y>=win_y-106 &&y<=win_y-82 )
	{
		funcsel=13;
		saved_data[data_c].funcsel=13;
		save_freehand();
	}
	if(x>=4 && x<=28 && y>=win_y-133 &&y<=win_y-109 )
	{
		funcsel=14;
	}
	if(x>=31 && x<=55 && y>=win_y-133 &&y<=win_y-109 )
	{
		funcsel=1;
	}
	if(x>=4 && x<=28&& y>=win_y-160 &&y<=win_y-136 )
	{
		funcsel=3;
	}
	if(x>=31 && x<=55 && y>=win_y-160 &&y<=win_y-136 )
	{
		funcsel=15;
	}
	if(x>=4 && x<=28 && y>=win_y-187 &&y<=win_y-163 )
	{
		funcsel=4;
	}
	if(x>=31 && x<=55 && y>=win_y-187 &&y<=win_y-163 )
	{
		funcsel=16;
	}
	if(x>=4 && x<=28 && y>=win_y-214 &&y<=win_y-190 )
	{
		funcsel=6;
				
	}
	if(x>=31 && x<=55 && y>=win_y-214 &&y<=win_y-190 )
	{
		funcsel=17;
	}
	if(x>=4 && x<=28 && y>=win_y-322 &&y<=win_y-298 )
	{
		funcsel=9;
		glPushMatrix();
		glutSetCursor(GLUT_CURSOR_TEXT);
	}
	if(x>=4 && x<=28 && y>=win_y-241 &&y<=win_y-217 )
	{
		funcsel=7;
	}
	if(x>=31 && x<=55 && y>=win_y-241 &&y<=win_y-217 )
	{
		funcsel=18;
	}
	if(x>=4 && x<=28 && y>=win_y-268 &&y<=win_y-244 )
	{
		funcsel=5;
	}
	if(x>=31 && x<=55 && y>=win_y-268 &&y<=win_y-244 )
	{
		funcsel=19;
	}
	if(x>=4 && x<=28 && y>=win_y-295 &&y<=win_y-271 )
	{
		funcsel=20;
	}
	if(x>=31 && x<=55 && y>=win_y-295 &&y<=win_y-271 )
	{
		funcsel=21;
	}
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	display_sel(funcsel);
	glPopMatrix();
}
int trans(int x,int y)
{
	y=win_y-y;
	if(funcsel==9)
	{
		glPopMatrix();
		glPushMatrix();
		if(cursor==0)
		{
		glViewport(58,40,win_x-58,win_y-52-40);
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		}
	}
	if(funcsel== 11||funcsel==12 ||funcsel==13||funcsel==2)
		saved_data[data_c-1].f_end=freehand_strtend-1;
	if(x>=160 && x<=184 && y>=10 &&y<=34 &&funcsel!=9 && funcsel!=12)//check for trans boundry
	{
		c=0;
		if(transparency==0)//if off,turn it on.
		{
					glEnable(GL_BLEND );
					glBlendFunc(GL_SRC_ALPHA, GL_ONE_MINUS_SRC_ALPHA);
					transparency=1;
					saved_data[data_c].funcsel=10;
					saved_data[data_c++].c=1;
					glPushMatrix();
					set_vp_icons();
					glViewport(0,0,win_x,win_y);
					glRasterPos2d(160,10);
					glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_on_icon);
					glPopMatrix();
				
		}
		else
		{
					saved_data[data_c].funcsel=10;
					saved_data[data_c++].c=0;
					glDisable(GL_BLEND );
					transparency=0;
					glPushMatrix();
					set_vp_icons();
					glViewport(0,0,win_x,win_y);
					glRasterPos2d(160,10);
					glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_off_icon);
					glPopMatrix();
					
		}
		glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
		return 1;
	}
	if(x>=3 && x<=27 && y>=win_y-50 && y<=win_y-26)
	{
		grape_new();
		
		return 1;

	}
	if(x>=30 && x<=54 && y>=win_y-50 && y<=win_y-26)
	{
		undo();
		return 1;
	}

	if(x>=57 && x<=81 && y>=win_y-50 && y<=win_y-26)
	{
		redo();
		
		return 1;
	}
	if(x>=84 && x<=108 && y>=win_y-50 && y<=win_y-26)
	{
		t_menu(1);
		return 1;
	}

	if(x>=111 && x<=135 && y>=win_y-50 && y<=win_y-26)
	{
		t_menu(0);
		
		return 1;
	}
	if(x>=295 && x<=319 && y>=10 &&y<=34)//backgrnd
	{
		c=0;
		if(bkgnd_active==0)
		{
			bkgnd_active=1;
			glPushMatrix();
			set_vp_icons();
			glViewport(0,0,win_x,win_y);
			glRasterPos2d(295,10);
			glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_on_icon);
			glPopMatrix();
		}
		else
		{
			bkgnd_active=0;
			glPushMatrix();
			set_vp_icons();
			glViewport(0,0,win_x,win_y);
			glRasterPos2d(295,10);
			glDrawPixels(24,24,GL_RGB,GL_UNSIGNED_BYTE,grape_trans_off_icon);
			glPopMatrix();
		}
		return 1;
	}
	return 0;

}
txt_curs(int value)//timer call back
{
	glViewport(58,40,win_x-58,win_y-52-40);

	if(funcsel==9 && text_first==1)
	{
		glLogicOp(GL_XOR);
			glColor3f(1.0,1.0,1.0);
			glPopMatrix();
			glPushMatrix();
			glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
			glLogicOp(GL_COPY);
			cursor=!cursor;
	}

	glutPostRedisplay();
	glFlush();
	glutSwapBuffers();
	glutTimerFunc(400,txt_curs,1);
	
}


void output(unsigned char key,int x,int y)
{
    glViewport(58,40,win_x-58,win_y-52-40);
	undo_c=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;undo_f=0;
	if(funcsel==9 && text_first==1)//text_first has to be set bcoz chars shdnt be displayed before a mouse click which is used to determine the pos 4 text
	{
			
		if(cursor ==0 )
			{
				glLogicOp(GL_XOR);
					glColor3f(1.0,1.0,1.0);
					glPopMatrix();
					glPushMatrix();
					glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
					cursor=!cursor;
			}
			glPopMatrix();
			glLogicOp(GL_COPY);
			glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	if(key==13)
	{
		glPopMatrix();
		glPushMatrix();
		glTranslatef(pts[0][0]-58,win_y-pts[0][1]-new_line-40, 0);
		new_line+=35;
		glScalef(0.20,0.20,0);//THE GREATER THE VALUE OF SX,SY.THE BIGGER WILL THE TEXT
	}
	else
	{
	glutStrokeCharacter(GLUT_STROKE_ROMAN,key);
	glTranslatef(0,0, 0);//first param wassss 10
	}
			glPushMatrix();
			text_saved[text_strtend++]=key;
				text_color_change =1;//cannot change color
		glutPostRedisplay();
	//save_text();
	}
	glFlush();
	glutSwapBuffers();
}
save_text(int x,int y)
{
	saved_data[data_c-1].t_end=text_strtend-1;
	saved_data[data_c].funcsel=9;
	saved_data[data_c].pts[0][0]=x-58;
	saved_data[data_c].pts[0][1]=win_y-y-40;
	saved_data[data_c].t_strt=text_strtend;
	saved_data[data_c].poly_color.r=cur_color.r;
	saved_data[data_c].poly_color.g=cur_color.g;
	saved_data[data_c].poly_color.b=cur_color.b;
}

text(int x,int y)
{
	set_vp_draw();
	glViewport(58,40,win_x-58,win_y-52-40);
	text_color_change =0;//can change txt color only after choosing the spot to be written and disabled once started typing
	text_first=1;//ascii codes can be accepted from the keyboard,i.e,after atleast one mouse click
	new_line=35;
	if(intermediate_chng_mouse_pos_for_txt!=0 )
	{
		glPopMatrix();
		if(cursor==0)
		{
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		glLogicOp(GL_COPY);
		}
	}
	glPopMatrix();
	glPushMatrix();
	glTranslatef(x-58,win_y- y-40, 0);
	glScalef(0.20,0.20,0);//THE GREATER THE VALUE OF SX,SY.THE BIGGER WILL THE TEXT
	glPushMatrix();
	glLogicOp(GL_XOR);
	glColor3f(1.0,1.0,1.0);
	glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
	glLogicOp(GL_COPY);
	glFlush();
	cursor=!cursor;
	if(intermediate_chng_mouse_pos_for_txt!=0)//if position of text gets changed in a single text select option.this new pos will be considered as new saved item.
			data_c++;//for saving
	save_text(x,y);
	intermediate_chng_mouse_pos_for_txt=1;//for saving.first time(after text selection),data_c need not be incremented	
	glutSwapBuffers();
	glutTimerFunc(400,(void*)txt_curs,1);//txt_curs is a timer callback
}
void mymouse(int btn,int state,int x,int y)
{
	
	
	if(btn==GLUT_LEFT_BUTTON && state==GLUT_DOWN)
		{
			if(trans(x,y))
				return;
			if(win_y-y<40 )
			{
				if(x<150)
					if(text_color_change ==0)
						select_color(x,y);
				glFlush();
				return;//otherwise points will be saved(unnecessary)
			}
			if(win_y-y<win_y-53 && win_y-y>40 && x<58)
			{
				select_fun(x,y);
				glFlush();
				return;
			}
			
			set_vp_draw();
			glViewport(58,40,win_x-58,win_y-52-40);
			
			if(funcsel==1 || funcsel==6 ||funcsel==3 ||funcsel ==4 ||funcsel==5||funcsel==7 ||funcsel==15||funcsel==16||funcsel==17||funcsel==18||funcsel==19||funcsel==20||funcsel==21)//becoz pt should not be saved when clicked under freehand mode
			{
				undo_c=0;undo_f=0;
				pts[c][0]=x;
				pts[c++][1]=y;
			}
			if(funcsel==14)
			{
				undo_c=0;undo_f=0;
				glReadPixels( x,win_y-y,1,1,GL_RGBA,GL_UNSIGNED_BYTE,pixels );
				cur_color.r=pixels[0];
				cur_color.g=pixels[1];
				cur_color.b=pixels[2];
				set_vp_icons();
				glViewport(0,0,win_x,win_y);
				highlighted_color();
				glPopMatrix();
				glPushMatrix();
				set_vp_draw();
				glViewport(58,40,win_x-58,win_y-52-40);
			}
			else if(c%2==0 && funcsel==1)
			{
				undo_c=0;undo_f=0;
				save_line();
				lines();
			}
			else if(c%2==0 && (funcsel==3 ||funcsel==15))
			{
				undo_c=0;undo_f=0;
				save_parallelogram();
				parallelogram();
				
			}
			else if(c%2==0 && c!=0 && (funcsel==4 ||funcsel==16))
			{
				undo_c=0;undo_f=0;
				save_square();
				square();
				
			}
			else if(c%2==0 && (funcsel==5 ||funcsel==19))
			{
				undo_c=0;undo_f=0;
				save_rectangle();
				rectangle();
				
			}
			else if(c%2==0 && (funcsel==6 ||funcsel==17))
			{
				undo_c=0;undo_f=0;
				save_circle();
				circles();
				
			}
			else if(c%2==0 && (funcsel==20 ||funcsel==21))
			{
				undo_c=0;undo_f=0;
				save_oval();
				oval();
				
			}
			else if(c%3==0 &&c!=0&& (funcsel==7 ||funcsel==18))
			{
				undo_c=0;undo_f=0;
				save_triangle();
				triangle();
				undo_c=0;undo_f=0;
			}
			else if(funcsel==9)
			{
				undo_c=0;undo_f=0;
				text(x,y);
				pts[0][0]=x;
				pts[0][1]=y;//used when \n pressed
				
			}
			else if(funcsel==2 ||funcsel== 11 || funcsel ==12 || funcsel ==13)//for erase,brush,pencil,spray
																		//implementation for a click 
			{
				undo_c=0;undo_f=0;
				mymotion(x,y);
			}
		}
	glutSwapBuffers();
}

void myinit()
{
	cur_color.r=0;
	cur_color.g=0;
	cur_color.b=0;
	bkgnd_color.r=255;
	bkgnd_color.g=255;
	bkgnd_color.b=255;
	glClearColor(bkgnd_color.r,bkgnd_color.g,bkgnd_color.b,1);
	glClear(GL_COLOR_BUFFER_BIT);
	set_vp_draw();
	glColor3f(0,0,0);//parameters value range from 0  - 255 if 3ub
	glPointSize(1.0);
}


void display1(void)
{
	glFlush();
	glutSwapBuffers();
}
void display(void)
{
	glutSetIconTitle(menu);
	draw_icons();
	glColor3b(cur_color.r,cur_color.g,cur_color.b);
	glFlush();
	glutSwapBuffers();
	glutDisplayFunc(display1);
}
 void filemenu(int val)
{
	exit(0);
}


read_text(int d)
{
	int i,e,x,y,new_line=35;
	e=(saved_data[d]).t_end;
	x=(saved_data[d]).pts[0][0];
	y=(saved_data[d]).pts[0][1];
	set_vp_draw();
	glViewport(58,40,win_x-58,win_y-52-40);
	glTranslatef(x,y, 0);
	glScalef(0.20,0.20,0);
	glScalef(zoom,zoom,0);
	for(i=(saved_data[d]).t_strt;i<=e;i++)
		if(text_saved[i]!=13)
		glutStrokeCharacter(GLUT_STROKE_ROMAN,text_saved[i]);
		else
		{
			set_vp_draw();
			glTranslatef(x,y-new_line, 0);
			glScalef(0.20,0.20,0);
			new_line+=35;
		}
	glFlush();

}
draw_freehand(int fun,int off)
{
	int i;
	switch(fun)
	{
		case 2:
			for(i=saved_data[off].f_strt;i<=saved_data[off].f_end;i++)
				erase(freehand_save_pts[i][0],freehand_save_pts[i][1]);
			break;
		case 11:pencil_line=1;//1,for new
				i=saved_data[off].f_strt;
				i++;
			for(;i<=saved_data[off].f_end-1;i++)
				pencil(freehand_save_pts[i][0],freehand_save_pts[i][1]);
				glEnd();
				glFlush();
			break;
				
		case 13:
			for(i=saved_data[off].f_strt;i<=saved_data[off].f_end;i++)
				spray(freehand_save_pts[i][0],freehand_save_pts[i][1]);
			break;
		case 12:
			for(i=saved_data[off].f_strt;i<=saved_data[off].f_end;i++)
				brush(freehand_save_pts[i][0],freehand_save_pts[i][1]);
			break;

	}
}
void display_saved()
{
	int i=0,w,t;
	GLbyte r,g,b;
	
	for(i=0;i<data_c;i++)
	{
		set_vp_draw();
		//glTranslated((win_x-68)/2,(win_y-52-60)/2,0);
		glScalef(zoom,zoom,0);
	
		glFlush();
		glViewport(58,40,win_x-58,win_y-52-40);
		funcsel=saved_data[i].funcsel;		
			r=(saved_data[i]).poly_color.r;
			g=(saved_data[i]).poly_color.g;
			b=(saved_data[i]).poly_color.b;
			
			glColor4ub(r,g,b,alpha);
			glFlush();
		switch (funcsel)
		{
			
		case 1:w=wide;
				t=type;
			c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
			wide=(saved_data[i]).wide;
			type=(saved_data[i]).type;
			lines();
			wide=w;
			type=t;
			break;
		case 3:
		case 15:
			c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
			parallelogram();
			break;
		case 4:
		case 16:
			c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
			square();
			break;
		case 6:
		case 17:
			c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
			circles();
			break;
		case 20:
		case 21:c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
			oval();
			break;
		case 7:
		case 18:
				c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
				pts[2][0]=(saved_data[i]).pts[2][0];
				pts[2][1]=(saved_data[i]).pts[2][1];				
				triangle();
				break;
		case 9:	read_text(i);
				
				break;
		case 5:
		case 19:
			c=saved_data[i].c;
			pts[0][0]=(saved_data[i]).pts[0][0];
			pts[0][1]=(saved_data[i]).pts[0][1];
			pts[1][0]=(saved_data[i]).pts[1][0];
			pts[1][1]=(saved_data[i]).pts[1][1];
				rectangle();
		
				break;
		case 2:
		case 11:
		case 12:
		case 13:draw_freehand(funcsel,i);
				break;
		case 10:if(saved_data[i].c==1)
				{
					glEnable(GL_BLEND );
				glBlendFunc(GL_SRC_ALPHA, GL_ONE_MINUS_SRC_ALPHA);
				}
				else
					glDisable(GL_BLEND );
				glFlush();
				break;

		}
//	glTranslated(-(win_x-68)/2,-(win_y-52-60)/2,0);//480,307
	}
}
void reddes()
{
	int	p=pencil_line,px=x_pencil,py=y_pencil;
//.win_x=x;
//.win_y=y;
	
	fun=funcsel;
	glDisable(GL_BLEND );
	glFlush();
	if(funcsel==9)
	{
		saved_data[data_c].t_end=text_strtend-1;//to display the recsent text  
		glPopMatrix();
		glPushMatrix();
		if(cursor==0)
		{
		glViewport(58,40,win_x-58,win_y-52-40);
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		}
		glLogicOp(GL_COPY);
		glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
		data_c++;
	}
	if(funcsel==12 ||funcsel==13||funcsel==2 )
	{
		saved_data[data_c-1].f_end=freehand_strtend-1;
		data_c++;
	}
//.	if(funcsel==11)
//.		save_freehand();
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	
	draw_icons();
	display_saved();
	funcsel=fun;
	glutSwapBuffers();

	
	glPopMatrix();
	glutSwapBuffers();
	if(funcsel==9)
		data_c--;
	if(transparency==1)
	{
		glEnable(GL_BLEND );
		glBlendFunc(GL_SRC_ALPHA, GL_ONE_MINUS_SRC_ALPHA);
	}
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	display_unsel(1);
	if(funcsel==0)
		display_sel(9);
	else
	display_sel(funcsel);
	glPopMatrix();
	glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	if(funcsel==12 ||funcsel==13||funcsel==2)
		data_c--;
	pencil_line=p;
	x_pencil=px;
	y_pencil=py;
set_vp_draw();
}


void redisplay(int x,int y)
{
	
	int	p=pencil_line,px=x_pencil,py=y_pencil;
win_x=x;
win_y=y;

	
	fun=funcsel;
	glDisable(GL_BLEND );
	glFlush();
	if(funcsel==9)
	{
		saved_data[data_c].t_end=text_strtend-1;//to display the recsent text  
		glPopMatrix();
		glPushMatrix();
		if(cursor==0)
		{
		glViewport(58,40,win_x-58,win_y-52-40);
		glLogicOp(GL_XOR);
		glColor3f(1.0,1.0,1.0);
		glutStrokeCharacter(GLUT_STROKE_ROMAN,'|');
		cursor=!cursor;
		}
		glLogicOp(GL_COPY);
		glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
		data_c++;
	}
	if(funcsel==12 ||funcsel==13||funcsel==2 )
	{
		saved_data[data_c-1].f_end=freehand_strtend-1;
		data_c++;
	}
	if(funcsel==11)
		save_freehand();
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	
	draw_icons();
	display_saved();
	funcsel=fun;
	glutSwapBuffers();

	
	glPopMatrix();
	glutSwapBuffers();
	if(funcsel==9)
		data_c--;
	if(transparency==1)
	{
		glEnable(GL_BLEND );
		glBlendFunc(GL_SRC_ALPHA, GL_ONE_MINUS_SRC_ALPHA);
	}
	glPushMatrix();
	set_vp_icons();
	glViewport(0,0,win_x,win_y);
	display_unsel(1);
	if(funcsel==0)
		display_sel(9);
	else
	display_sel(funcsel);
	glPopMatrix();
	glColor4ub(cur_color.r,cur_color.g,cur_color.b,alpha);
	if(funcsel==12 ||funcsel==13||funcsel==2)
		data_c--;
	pencil_line=p;
	x_pencil=px;
	y_pencil=py;
set_vp_draw();
}
void h_menu(int id)
{
}
void ty_menu(int id)
{
	type=id;
}
void th_menu(int id)
{
	if(id==1)
		wide=1;
	else if(id==2)
		wide=3;
	else 
		wide=6;
}
void li_menu(int id)
{
}
create_menu()
{
	file_menu=glutCreateMenu(f_menu);
	glutAddMenuEntry("new    ",1);
	glutAddMenuEntry("exit   ",2);

	edit_menu=glutCreateMenu(e_menu);
	glutAddMenuEntry("undo  ",1);
	glutAddMenuEntry("redo  ",2);

	help_menu=glutCreateMenu(h_menu);
	glutAddMenuEntry("about ...",1);//the value of help menu is 3.
	//printf("%d",help_menu);

	typ1_menu=glutCreateMenu(ty_menu);
	glutAddMenuEntry("simple line  ",1);
	glutAddMenuEntry("stripple1  ",2);
	glutAddMenuEntry("stripple2  ",3);

	thik1_menu=glutCreateMenu(th_menu);
	glutAddMenuEntry("thin  ",1);
	glutAddMenuEntry("thick  ",2);
	glutAddMenuEntry("thicker  ",3);

	line_menu=glutCreateMenu(li_menu);
	glutAddSubMenu("type  ",typ1_menu);
	glutAddSubMenu("thickness  ",thik1_menu);


	tools_menu=glutCreateMenu(t_menu);
	glutAddMenuEntry("Zoom in",1);
	glutAddMenuEntry("Zoom out",2);
}

int main(int argc,char* argv[])
{
	
	glutInit(&argc,argv);
	glutInitDisplayMode(GLUT_RGB|GLUT_DOUBLE);
	create_menu();
	win_x=1018;
	win_y=708;
	glutInitWindowSize(win_x,win_y);
	win=glutCreateWindow("GRAPE-GRAPhics Editor");
	glutMouseFunc(mymouse);
	glutMotionFunc(mymotion);
	glutPassiveMotionFunc(manage_icons);
	myinit();
	glEnable(GL_COLOR_LOGIC_OP);
	glLogicOp(GL_COPY);
	glutKeyboardFunc(output);
	glutDisplayFunc(display);
	glutReshapeFunc(redisplay);
	glutSetMenu(line_menu);
	glutAttachMenu(GLUT_RIGHT_BUTTON);
	glutMainLoop();
	return 0;
}

